zBlueBird/temperture/temprature-master-based-on-rtl8762c/src/flash/silent_dfu_flash.c
    if (length % 4)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (p_void == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (SIGNATURE_APP_DEFINE != signature)
    {
        /*get back up area address*/
#ifdef SDK_8772
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)signature);
#else

#if (SUPPORT_OTA_APP_DATA_EXTENSION == 1)
        dfu_base_addr = flash_ioctl(flash_ioctl_get_temp_bank_addr_by_image_id_ext, (T_IMG_ID)signature, 0);
#else
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)signature);
#endif

#endif
    }
    else
    {
        /*get back up area address*/
        dfu_base_addr = APP_DEFINE_DATA_ADDR;
    }

    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    /* before erase temp image or write image to flash temp, check access length depend flash layout */
    if (!check_dfu_update_image_length(signature, offset, length, p_void, &result))
    {
        goto L_Return;
    }

    /*if it's start_packet*/
    if (offset == 0)
    {
        T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_void;
        p_header->ctrl_flag.flag_value.not_ready = 0x1; /*access ram addr, make sure image is not ready*/
        DFU_PRINT_TRACE3("dfu_update New Image Header:0x%08x, Signature:0x%08x, dfu_base_addr:0x%08x",
                         length, signature, dfu_base_addr);
    }

    if ((offset % FMC_SEC_SECTION_LEN) == 0)   //new page starts
    {
        flash_erase_sector(dfu_base_addr + offset);
    }
    else  // cross page
    {
        if ((offset / FMC_SEC_SECTION_LEN) != ((offset + length) / FMC_SEC_SECTION_LEN))
        {
            flash_erase_sector((dfu_base_addr + offset + length) & ~(FMC_SEC_SECTION_LEN - 1));
        }
    }
    start_addr = dfu_base_addr + offset;

#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
    result = sil_dfu_write(start_addr, length, (uint8_t *)p_void);
    if (result)
    {
        goto L_Return;
    }
#else
    for (int i = 0; i < length; i = i + 4)
    {
        uint32_t s_val;
        flash_auto_write_locked(start_addr + i, *(uint32_t *)p_void);

        flash_auto_read_locked((start_addr + i) | FLASH_OFFSET_TO_NO_CACHE, &s_val);
        if (s_val != *(uint32_t *)p_void)
        {
            DFU_PRINT_TRACE3("s_val:0x%08x, *p_void:0x%08x, i:0x%08x",
                             s_val, *(uint32_t *)p_void, i);
            result = __LINE__;
            goto L_Return;
        }
        else
        {
            p_void++;
        }
    }
#endif

//    ota_offset = offset + length; //for re-ota
    if (SIGNATURE_APP_DEFINE == signature)
    {
        appdefine_offset = offset + length;
    }

L_Return:

    DFU_PRINT_INFO1("<==dfu_update result:%d \r\n", result);
    return result;
}

#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
static void slient_dfu_read_image_data(uint8_t *dest, uint8_t *sour, uint32_t len)
{
    uint32_t counter = 0;
    if (OTP->image_split_read)
    {
        flash_split_read_locked((uint32_t)sour, len, dest, &counter);  //better performance
    }
    else
    {
        flash_read_locked((uint32_t)sour, len, dest);
    }
}

static uint16_t slient_dfu_process_crc(uint16_t fcs, uint8_t *buf, uint32_t buf_max_size,
                                       uint8_t *pdata,
                                       size_t data_len)
{
    uint16_t loop_cnt = data_len / buf_max_size;
    uint16_t remain_size = data_len % buf_max_size;
    uint16_t i;

    for (i = 0; i < loop_cnt; ++i)
    {
        slient_dfu_read_image_data(buf, pdata, buf_max_size);
        fcs = btxfcs(fcs, buf, buf_max_size);
        pdata += buf_max_size;
    }
    if (remain_size)
    {
        if ((remain_size % 4) == 0)
        {
            slient_dfu_read_image_data(buf, pdata, remain_size);
            fcs = btxfcs(fcs, buf, remain_size);
        }
        else
        {
            fcs = btxfcs(fcs, pdata, remain_size);
        }
    }

    return fcs;
}

/**
 * @brief  calculated CRC checksum over the image, and compared with given checksum value.
 *
 * @param  p_header          image header info of the given image.
 * @return true if image integrity check pass via checksum compare, false otherwise.
*/
bool slient_dfu_check_crc(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    uint8_t buf[CRC_BUFFER_SIZE];
    uint16_t calced_crc16;
    uint16_t img_crc16;
    uint32_t temp;

    uint32_t length = IMG_HEADER_SIZE - DFU_HEADER_SIZE - 256 - 16;
    uint8_t *pdata = (uint8_t *) p_header + DFU_HEADER_SIZE;
    calced_crc16 = slient_dfu_process_crc(BTXFCS_INIT, buf, CRC_BUFFER_SIZE, pdata, length);

    //get payload length
    flash_read_locked((uint32_t)p_header + 8, 4, (uint8_t *)&length);
    length += 16;
    pdata = (uint8_t *) p_header + IMG_HEADER_SIZE - 16;
    calced_crc16 = slient_dfu_process_crc(calced_crc16, buf, CRC_BUFFER_SIZE, pdata, length);

    //get crc16
    flash_read_locked((uint32_t)p_header + 4, 4, (uint8_t *)&temp);
    img_crc16 = temp >> 16;

    DFU_PRINT_INFO2("<===dfu_check_crc checksum16: 0x%04x, expect: 0x%04x\r\n", calced_crc16,
                    img_crc16);

    return (img_crc16 == calced_crc16);
}


static void slient_dfu_process_sha256(SHA256_CTX *ctx, uint8_t *buf, uint32_t buf_max_size,
                                      uint8_t *pdata,
                                      size_t data_len)
{
    uint16_t loop_cnt = data_len / buf_max_size;
    uint16_t remain_size = data_len % buf_max_size;
    uint16_t i;

    for (i = 0; i < loop_cnt; ++i)
    {
        slient_dfu_read_image_data(buf, pdata, buf_max_size);
        SHA256_Update(ctx, buf, buf_max_size);
        pdata += buf_max_size;
    }
    if (remain_size)
    {
        slient_dfu_read_image_data(buf, pdata, remain_size);
        SHA256_Update(ctx, buf, remain_size);
    }
}


bool slient_dfu_check_sha256(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    SHA256_CTX ctx;
    uint8_t buf[SHA256_BUFFER_SIZE];
    uint8_t sha256sum[SHA256_LENGTH];
    uint8_t sha256img[SHA256_LENGTH];
    uint32_t payload_len = 0;

    SHA256_Init(&ctx);

    uint8_t *pdata = (uint8_t *)p_header + DFU_HEADER_SIZE;
    slient_dfu_process_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, 360);

    pdata = (uint8_t *)p_header + 404;
    slient_dfu_process_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, 348);

    pdata = (uint8_t *)p_header + IMG_HEADER_SIZE - 16;
    //get payload length in img header
    flash_read_locked((uint32_t)p_header + 8, 4, (uint8_t *)&payload_len);
    slient_dfu_process_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, (16 + payload_len));

    SHA256_Final(&ctx, sha256sum);
    //get sha256 in img header
    flash_read_locked((uint32_t)p_header + 372, sizeof(sha256img), sha256img);

    DFU_PRINT_INFO2("dfu_check_sha256: Calculating result: %b %b", TRACE_BINARY(SHA256_LENGTH,
                                                                                sha256sum), TRACE_BINARY(SHA256_LENGTH, sha256img));

    return (memcmp(sha256img, sha256sum, SHA256_LENGTH) == 0);
}

/**
 * @brief  calculated checksum(CRC16 or SHA256 determined by image) over the image, and compared
 *         with given checksum value.
 * @param  p_header image header info of the given image.
 * @return true if image integrity check pass via checksum compare, false otherwise.
*/
bool silent_check_image_chksum(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    bool ret;
    uint16_t crc16 = 0;
    uint32_t r_data = 0;
    ret = flash_read_locked((uint32_t)p_header + 4, sizeof(r_data), (uint8_t *)&r_data);
    if (ret)
    {
        crc16 = r_data >> 16;
        DFU_PRINT_INFO1("crc16=0x%x", crc16);

        if (crc16)
        {
            ret = slient_dfu_check_crc(p_header);
        }
        else
        {
            ret = slient_dfu_check_sha256(p_header);
        }
    }

    return ret;
}
#endif

/**
 * @brief calculate checksum of the image and compare with given checksum value.
 *
 * @param   image_id     signature to identify image.
 * @return  true if the image integrity check passes, false otherwise
*/
bool silent_dfu_check_checksum(uint16_t image_id)
{
    bool check_result;

    if (image_id == SIGNATURE_APP_DEFINE)
    {
        silent_dfu_reset(image_id);

        /* because APP_DEFINE_DATA_ADDR is not located flash block protect range, needn't unlock bp */
        T_IMG_CTRL_HEADER_FORMAT *p_appdefine_header = (T_IMG_CTRL_HEADER_FORMAT *)(
                                                           APP_DEFINE_DATA_ADDR | FLASH_OFFSET_TO_NO_CACHE);
        /*use flash auto mode if OTP->image_split_read == 0, can skip flash_lock and unlock*/
        if (OTP->image_split_read)
        {
            flash_lock(FLASH_LOCK_USER_MODE_READ);
        }
#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
        check_result = silent_check_image_chksum(p_appdefine_header);
#else
        check_result = check_image_chksum(p_appdefine_header);
#endif
        /*flash auto mode when OTP->image_split_read = 0, skip flash_lock and unlock*/
        if (OTP->image_split_read)
        {
            flash_unlock(FLASH_LOCK_USER_MODE_READ);
        }
        /*don't need unlock bp*/

