zBlueBird/temperture/temprature-master-based-on-rtl8762c/src/flash/silent_dfu_flash.c
        /*
        mark image as ready:
        p_appdefine_header->ctrl_flag.flag_value.not_ready = 0;
        there are two reasons we must use user mode API:
        1. support flash larger than 64M bits.
        2. support 4 bit mode: PRM enabled and programming non cache space doesn't supported.
        */
        uint32_t r_data;
        flash_read_locked((uint32_t)p_appdefine_header, sizeof(r_data), (uint8_t *)&r_data);
        r_data &= ~BIT23; /* not_ready */
        flash_write_locked((uint32_t)p_appdefine_header, sizeof(r_data), (uint8_t *)&r_data);
    }
    else
    {
        /* need modify p_header->ctrl_flag.not_ready, so first unlock flash bp*/
        unlock_flash_all();
        /*use flash auto mode if OTP->image_split_read == 0, can skip flash_lock and unlock*/
        if (OTP->image_split_read)
        {
            flash_lock(FLASH_LOCK_USER_MODE_READ);
        }
        check_result = dfu_check_checksum(image_id);
        /*flash auto mode when OTP->image_split_read = 0, skip flash_lock and unlock*/
        if (OTP->image_split_read)
        {
            flash_unlock(FLASH_LOCK_USER_MODE_READ);
        }
        lock_flash();
    }

    return check_result;
}

bool silent_dfu_reset(uint16_t image_id)
{
    bool ret = true;
    if (image_id == SIGNATURE_APP_DEFINE)
    {
        appdefine_offset = 0;
    }
    else
    {
        ret = dfu_reset(image_id);
    }
    return ret;
}


uint32_t dfu_flash_check_appdefine_blank(uint32_t appdefine_addr, uint32_t offset, uint16_t size)
{
    uint32_t i = 0;
    uint32_t result = 0;
    uint32_t start_addr = appdefine_addr + offset;
    DFU_PRINT_INFO2("<====dfu_flash_check_appdefine_blank :start_addr = %x, size:%d", start_addr, size);

    for (i = 0; i < size / 4; i++)
    {
        uint32_t r_data;
        flash_read_locked(start_addr, 4, (uint8_t *)&r_data);
        if (r_data != 0xffffffff)
        {
            result = __LINE__;
            goto L_Return;
        }
        start_addr += 4;
    }

L_Return:
    DFU_PRINT_INFO2("<====dfu_flash_check_appdefine_blank :i = %x, result:%d", i, result);
    return result;
}






